In [1]:
import pandas as pd
import numpy as np
filepath = "../datasets/athletes/"

In [2]:
main_data = pd.read_csv(filepath + "Medals.csv", encoding="ISO-8859-1")
country_data = pd.read_csv(filepath + "Athelete_Country_Map.csv", encoding="ISO-8859-1")
sport_data = pd.read_csv(filepath + "Athelete_Sports_Map.csv", encoding="ISO-8859-1")

In [3]:
len(main_data)

8618

In [4]:
len(main_data['Athlete'].unique())

6956

In [5]:
len(country_data)

6970

In [6]:
len(sport_data)

6975

In [7]:
country_data[country_data['Athlete']=='Aleksandar Ciric']

               Athlete                Country
1029  Aleksandar Ciric                 Serbia
1086  Aleksandar Ciric  Serbia and Montenegro

In [8]:
country_data_unique = country_data.drop_duplicates(subset='Athlete')

In [9]:
len(country_data_unique)

6956

In [10]:
country_data_unique[country_data_unique['Athlete']=='Aleksandar Ciric']

               Athlete Country
1029  Aleksandar Ciric  Serbia

In [11]:
main_data_less = main_data[main_data['Athlete']!='Michael Phelps']

In [12]:
len(main_data_less)

8615

In [13]:
country_data_unique_less = country_data_unique[country_data_unique['Athlete']!='Aleksey Nemov']

In [14]:
len(country_data_unique_less)

6955

In [15]:
main_data_less.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6
5,Alicia Coutts,24.0,2012,08/12/2012,1,3,1,5
6,Missy Franklin,17.0,2012,08/12/2012,4,0,1,5
7,Ryan Lochte,27.0,2012,08/12/2012,2,2,1,5

## Inner join
Se completan las filas con la información de ambas.  
Sólo se conservan las filas coincidentes.

In [16]:
merged_inner = pd.merge(left=main_data_less, 
                        right=country_data_unique_less, 
                        how='inner', 
                        left_on='Athlete', 
                        right_on='Athlete', 
                        validate='m:1') ##raise error if right is not unique '1:1','m:1','1:m','m:m'

In [17]:
len(merged_inner)

8614

In [18]:
merged_inner.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
1,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States
2,Natalie Coughlin,29.0,2012,08/12/2012,0,0,1,1,United States
3,Alicia Coutts,24.0,2012,08/12/2012,1,3,1,5,Australia
4,Missy Franklin,17.0,2012,08/12/2012,4,0,1,5,United States

## Left join
Se completan todos las filas de la izquierda con la información correspondiente que aporta la derecha.  
Si no hay correspondencia se completa con NaN

In [19]:
merged_left = pd.merge(left=main_data_less, 
                       right=country_data_unique_less, 
                       how='left', 
                       left_on='Athlete', 
                       right_on='Athlete', 
                       validate='m:1') ##raise error if right is not unique '1:1','m:1','1:m','m:m'

In [20]:
len(merged_left)

8615

In [21]:
merged_left.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
1,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6,NaN
2,Alicia Coutts,24.0,2012,08/12/2012,1,3,1,5,Australia
3,Missy Franklin,17.0,2012,08/12/2012,4,0,1,5,United States
4,Ryan Lochte,27.0,2012,08/12/2012,2,2,1,5,United States

## Right join
Se completan todos las filas de la derecha con la información correspondiente que aporta la izquierda.  
Si no hay correspondencia se completa con NaN

In [22]:
merged_right = pd.merge(left=main_data_less, 
                       right=country_data_unique_less, 
                       how='right', 
                       left_on='Athlete', 
                       right_on='Athlete', 
                       validate='m:1') ##raise error if right is not unique '1:1','m:1','1:m','m:m'

In [23]:
len(merged_right)

8615

In [24]:
merged_right.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Natalie Coughlin,25.0,2008.0,08/24/2008,1.0,2.0,3.0,6.0,United States
1,Natalie Coughlin,21.0,2004.0,08/29/2004,2.0,2.0,1.0,5.0,United States
2,Natalie Coughlin,29.0,2012.0,08/12/2012,0.0,0.0,1.0,1.0,United States
3,Alicia Coutts,24.0,2012.0,08/12/2012,1.0,3.0,1.0,5.0,Australia
4,Missy Franklin,17.0,2012.0,08/12/2012,4.0,0.0,1.0,5.0,United States

## Outer join
Se conservan todas las filas de la izquierda y de la derecha y se completa con la información que coincida de la otra.  
Se completan los valores de las filas no coincidentes con NaN

In [25]:
merged_outer = pd.merge(left=main_data_less, 
                       right=country_data_unique_less, 
                       how='outer', 
                       left_on='Athlete', 
                       right_on='Athlete', 
                       validate='m:1') ##raise error if right is not unique '1:1','m:1','1:m','m:m'

In [26]:
len(merged_outer)

8616

In [27]:
merged_outer.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Natalie Coughlin,25.0,2008.0,08/24/2008,1.0,2.0,3.0,6.0,United States
1,Natalie Coughlin,21.0,2004.0,08/29/2004,2.0,2.0,1.0,5.0,United States
2,Natalie Coughlin,29.0,2012.0,08/12/2012,0.0,0.0,1.0,1.0,United States
3,Aleksey Nemov,24.0,2000.0,10/01/2000,2.0,1.0,3.0,6.0,NaN
4,Alicia Coutts,24.0,2012.0,08/12/2012,1.0,3.0,1.0,5.0,Australia

**Michael Phelps no está en izquierda**

In [28]:
merged_inner[merged_inner['Athlete']=='Michael Phelps']

Empty DataFrame
Columns: [Athlete, Age, Year, Closing Ceremony Date, Gold Medals, Silver Medals, Bronze Medals, Total Medals, Country]
Index: []

In [29]:
merged_left[merged_left['Athlete']=='Michael Phelps']

Empty DataFrame
Columns: [Athlete, Age, Year, Closing Ceremony Date, Gold Medals, Silver Medals, Bronze Medals, Total Medals, Country]
Index: []

In [30]:
merged_right[merged_right['Athlete']=='Michael Phelps']

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
8614,Michael Phelps,NaN,NaN,NaN,NaN,NaN,NaN,NaN,United States

In [31]:
merged_outer[merged_outer['Athlete']=='Michael Phelps']

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
8615,Michael Phelps,NaN,NaN,NaN,NaN,NaN,NaN,NaN,United States

**Aleksey Nemov no está en la derecha**

In [32]:
merged_inner[merged_inner['Athlete']=='Aleksey Nemov']

Empty DataFrame
Columns: [Athlete, Age, Year, Closing Ceremony Date, Gold Medals, Silver Medals, Bronze Medals, Total Medals, Country]
Index: []

In [33]:
merged_left[merged_left['Athlete']=='Aleksey Nemov']

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
1,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6,NaN

In [34]:
merged_right[merged_right['Athlete']=='Aleksey Nemov']

Empty DataFrame
Columns: [Athlete, Age, Year, Closing Ceremony Date, Gold Medals, Silver Medals, Bronze Medals, Total Medals, Country]
Index: []

In [35]:
merged_outer[merged_outer['Athlete']=='Aleksey Nemov']

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
3,Aleksey Nemov,24.0,2000.0,10/01/2000,2.0,1.0,3.0,6.0,NaN